import React from 'react';
import Tabs from '@mui/material/Tabs';
import Tab from '@mui/material/Tab';
import Typography from '@mui/material/Typography';
import Box from '@mui/material/Box';
import styled from 'styled-components';
import 물병자리 from '../img/물병자리.png';
import 물고기자리 from '../img/물고기자리.png';
import 양자리 from '../img/양자리.png';
import 황소자리 from '../img/황소자리.png';
import 쌍둥이자리 from '../img/쌍둥이자리.png';
import 게자리 from '../img/게자리.png';
import 사자자리 from '../img/사자자리.png';
import 처녀자리 from '../img/처녀자리.png';
import 천칭자리 from '../img/천칭자리.png';
import 전갈자리 from '../img/전갈자리.png';
import 사수자리 from '../img/사수자리.png';
import 염소자리 from '../img/염소자리.png';

interface TabPanelProps {
    children?: React.ReactNode;
    index: number;
    value: number;
}

function TabPanel(props: TabPanelProps) {
    const { children, value, index, ...other } = props;

    return (
        <div
            role="tabpanel"
            hidden={value !== index}
            style={{ flex: 1 }}
            {...other}
        >
            {value === index && (
                <Box sx={{ p: 3 }}>
                    <Typography style={{ color: 'white' }}>{children}</Typography>
                </Box>
            )}
        </div>
    );
}

const Container = styled.div`
    width: 100%;
    display: flex;
    padding: 30px;
`;

const Keyword = styled.p`
    font-size: 22px;
    font-weidht: bold;
    margin-bottom: 15px;
    background: #ffffff52;
    padding: 3px 6px;
`;

const Description = styled.p`
    text-wrap: wrap;
    word-break: break-word;
    white-space: break-spaces;
`;

const Personality = () => {
    const [value, setValue] = React.useState(0);

    const handleChange = (_: any, newValue: number) => {
        setValue(newValue);
    };

    const itemList = [
        {
            id: 0,
            title: '물병자리',
            img: 물병자리,
            keyword: '독립적 / 진취적 / 인도주의적',
            desc: `물병자리 태생들은 독창적이고 인습에 얽매이지 않으며, 진취적이고 독립성이 강합니다.이들은 인류 문제에 깊은 관심을 가지며, 이것이 하나의 지적 운동처럼 느껴집니다.항상 객관적인 관찰자 역할을 하며, 사심과 감정이 섞이지 않은 견해를 밝히는 특징이 있습니다.\n\n물병자리 태생들은 사람들이 큰 집단을 형성하고 그 안에서 활동하는 별개의 개인임을 인식하며 사고할 수 있습니다.이러한 인도주의적인 인식이 강력한 특성으로 나타나며, 박애주의적 목표와 대의를 위해 일하는 경우가 많습니다.차별 의식이 없어서 우호적이고, 남을 잘 돕고, 낯선 사람에게도 늘 친근하게 대합니다.\n\n반항적인 기질은 지배성인 천왕성의 영향으로 나타납니다.천왕성은 앞을 내다보는 힘을 부여하고, 자유를 추구하는 강한 욕구를 심어주는 행성입니다.물병자리 태생들은 지시받는 것을 좋아하지 않으며, 스스로 생각하고 자신만의 방식으로 일을 하길 원합니다.지나치게 강요하면 정반대로 행동하는 경향이 강하며, 고정된 별자리의 특성과 결합되어 완고한 성격을 보입니다.하지만 객관적으로 제시되는 다른 의견에는 항상 기꺼이 귀를 기울입니다.\n\n미래 지향적인 시각을 가지고 있어 새로운 기술이나 혁신을 겁내지 않고 받아들입니다.천왕성과 마찬가지로 전기적 자질을 지니고 있으며, 이는 정신적 직관 형태로 나타날 수 있고,갑자기 깨닫는 '유레카 효과'를 경험할 수 있습니다.변덕이 심하고 예측하기 어렵지만, 매우 독창적이고 괴짜 같은 천재성을 지닌 이들입니다.`
        },
        {
            id: 1,
            title: '물고기자리',
            img: 물고기자리,
            keyword: '감상적 / 상상력 / 이상주의적',
            desc: `물고기자리 태생들은 감정적으로 매우 발달한 사람들입니다. 이들은 외부 환경의 영향을 민감하게 받아들이고, 내면의 자극도 예리하게 인식합니다. 강력하고 경이로운 상상의 세계를 즐기며, 때로는 삶의 가혹한 현실을 피하기 위해 혼자만의 꿈의 세계로 도망가기도 합니다.\n\n물고기자리의 상징은 반대 방향으로 헤엄치는 두 마리 물고기인데, 이는 이중적인 성격을 잘 나타냅니다. 물고기자리 태생들은 때로는 무기력하고 지쳐 보이지만, 또 다른 순간에는 효율적이고 정확하며 매우 근면하게 일할 수 있습니다.\n\n이들은 사람들의 미묘한 감정의 기미를 알아차리고, 관대하고 동정심이 많습니다. 그러나 주위에 확고한 경계를 정하지 않기 때문에 다른 사람들이 원하는 것에 자기 자신을 잃을 수 있습니다. 따라서 자아 존중감을 잃지 않도록 주의하고, 희생을 자처하지 않도록 조심하는 것이 중요합니다.\n\n자신감을 키우려면 자신에 대한 확신이 필요하며, 때로는 매우 완고해서 어떤 사람에게도 영향을 받지 않기도 합니다. 물고기자리는 황도에서 가장 이기적이지 않은 별자리로, 인내심이 지극히 강하지만, 화가 나면 놀라울 정도로 공격적일 수 있습니다.\n\n감상적이고 인정이 많으며 부드러운 감정을 가진 물고기자리 태생들은 주위 환경이나 다른 사람들의 감정을 잘 받아들입니다. 이런 특징이 놀라운 상상력과 결합되어 치유, 음악, 예술, 드라마, 사진, 그리고 정신세계와 관련된 분야에서 뛰어난 능력을 발휘합니다.\n\n물고기자리 태생들은 기분이 자주 변하는데, 때로는 지극히 낙천적이고 때로는 애매모호하거나 추진력이 부족해 쉽게 포기하기도 합니다. 이상주의적인 성향이 있어, 자신의 높은 기대와 꿈을 다른 사람들에게 투영하다가 결국 환멸을 느끼기도 합니다. 그럼에도 불구하고, 물고기자리 태생들은 유머, 매력, 공감력으로 주변 사람들에게 행복을 주는 몽상가들입니다.`
        },
        {
            id: 2,
            title: '양자리',
            img: 양자리,
            keyword: '열정적 / 충동적 / 자기중심적',
            desc: `양자리 태생들은 에너지와 창조적인 아이디어가 넘치는 황도의 첫 번째 별자리에 속합니다. 불의 별자리인 양자리는 활기차고 열정적인 기질을 지녔으며, 세상을 탐구하고 정복할 대상으로 여기며 삶에 대해 매우 적극적인 태도를 보입니다.\n\n천성적으로 열정적이고 추진력이 강한 이들은 끊임없이 프로젝트를 벌이고 활발히 활동하며 빠르게 앞으로 나아갑니다. 황도의 개척자이자 리더로서, 겉보기엔 조용해도 속으로는 무언가에서 최고가 되기를 원합니다.\n\n양자리 태생들은 화성의 영향을 받아 행동 지향적이며, 빈둥거리며 시간을 보내는 일이 드뭅니다. 활동적인 육체와 대담하고 진취적인 정신이 결합되어 어떤 일이든 선두에 서려고 하죠.\n\n대담하고 열정적이며 이상주의적인 성향을 지닌 이들은 사랑하는 사람들에게도 매우 충실합니다. 파트너와 자신이 좋아하는 일에 대해 이야기하는 걸 좋아하며, 항상 힘이 되어주려 노력합니다.\n\n하지만 인내심이 강한 편은 아닙니다. 직접적이고 단호하며 솔직한 접근 방식을 선호하고, 교묘하게 행동하거나 요령을 부리는 데에는 관심이 없습니다. 이런 성격은 양자리 태생들이 성급하고 충동적이며 순간적인 분별없는 행동을 할 가능성도 높게 만듭니다. 그럼에도 불구하고, 이들은 과제에 정면으로 맞서고 힘든 상황에 용감히 대처할 수 있는 강인함을 지녔습니다.\n\n양자리들은 쉽게 화를 내고 자기 의견을 강하게 표현하려 하지만, 동시에 쉽게 용서하고 금세 잊어버리는 순수한 면도 있습니다.\n\n아드레날린의 자극을 잘 받고, 성급한 성격 탓에 세세한 부분까지 챙기지는 못하는 경향이 있습니다. 그래서 새로운 프로젝트를 시작할 때에는 강점을 보이지만, 천진난만한 자기중심성이나 타인을 괴롭히는 행동은 스스로 경계할 필요가 있습니다.`
        },
        {
            id: 3,
            title: '황소자리',
            img: 황소자리,
            keyword: '합리적 / 매력적 / 현실적',
            desc: `황소자리 태생들은 조용하고 단호하며, 매우 합리적인 성격을 가진 사람들입니다. 절대 포기를 모르는 이들은 인내심과 끈기가 넘쳐, 다른 사람들이 도중에 실패해도 계속해서 나아갑니다. 따뜻한 마음과 차분하며 느긋한 태도를 지닌 황소자리 태생들은 소박한 삶의 즐거움을 알고, 그것을 소중히 여깁니다.\n\n이들은 급하게 일을 시작하지 않으며, 안전성과 경제적 안정성을 중요하게 고려합니다. 결정을 내릴 때는 신중하고 주의 깊게 접근하는 성향을 보입니다.\n\n금성의 영향을 받는 황소자리 태생들은 사람의 마음을 강하게 끌며, 매우 관능적이고 이성에게 매력적인 존재입니다. 금성은 또한 미에 대한 사랑과 예술적 감각을 부여하고, 정교한 촉각을 가지고 있어 예술적 활동에서 뛰어난 재능을 보이기도 합니다.\n\n현실적인 성향을 지닌 황소자리 태생들은 음식이나 집과 같은 기본적인 삶의 안락함을 매우 중요하게 생각합니다. 요리 솜씨가 뛰어나고, 와인에도 일가견이 있으며, 놀이를 즐기기도 합니다. 또한, 대다수의 황소자리 태생들은 금전 거래 목록을 꼼꼼하게 작성하는 편입니다. 물질주의자라는 평가를 받을 때, 이들은 자신들이 단지 합리적이고 돈의 가치를 알기 때문이라고 반박할 것입니다. 이들은 돈과 관련된 문제부터 자기 자신에 이르기까지 모든 것을 평가하는 데 능합니다.\n\n황소자리 태생들은 매력적이고 차분한 목소리로 노래를 잘하는 사람들이 많습니다. 하지만 스트레스를 받으면 목에 병이 생길 수 있으므로, 이를 관리하는 것이 중요합니다. 그럼에도 불구하고 황소자리에서 태어난 사람들은 대체로 강건한 체력을 지니고 있습니다.\n\n재미있는 것을 찾아 즐기는 것을 좋아하지만, 너무 거기에만 빠지지 않도록 주의해야 합니다. 황소자리 태생들은 현실적이고 끈기 있으며, 목표를 향해 근면하게 노력하는 성향을 가지고 있습니다. 탄탄한 토대를 쌓겠다는 확고한 열망으로 성공을 거둘 수 있는 능력을 지닌 이들입니다.`
        },
        {
            id: 4,
            title: '쌍둥이자리',
            img: 쌍둥이자리,
            keyword: '열정적 / 다재다능 / 달변',
            desc: `쌍둥이자리 태생들은 지식을 끝없이 갈망하며, 천부적으로 소통에 능한 영원한 학생들입니다. 그들은 끊임없이 정신적 호기심을 충족시키려고 노력하며 항상 바쁜 일정을 보내죠. 어떤 주제든 핵심을 빠르게 파악하고, 방대한 지식을 습득하여 타인과 나누는 걸 즐깁니다. 똑똑하고 다재다능하며 열정적이지만, 에너지를 너무 많은 방향으로 분산시키지 않도록 주의해야 합니다.\n\n대체로 얼굴이 밝고 표정이 풍부하며, 자신의 생각을 전할 때 손을 자주 사용합니다. 이야기하는 걸 좋아해 몇 시간이고 수다를 떠는 걸 즐기니, 통신비 걱정을 해야 할지도 모르겠네요. 쌍둥이자리 태생들은 늘 호기심으로 가득 차 있어, 영원한 아이처럼 비유되기도 합니다.\n\n이들은 신경이 예민하고, 어떤 일이나 사람에게 전적인 관심을 집중하기 어려운 성향을 보입니다. 상징인 쌍둥이처럼 한 번에 두 가지 일을 잘 해내며, 융통성 있고 다재다능하며 적응력이 뛰어난 것으로 유명합니다. 쾌활하고 세련된 이들은 속박을 싫어하고, 따분하거나 지루한 것을 거부합니다. 일관성이 부족해 보이거나 기분이 자주 바뀌는 경향이 있지만, 그만큼 지적인 자극을 더 선호합니다. 세속적인 열정보다는 정신적 자극을 주는 과제들에 더 큰 관심을 가집니다.\n\n명랑하고 친화적인 성격 덕분에 다른 사람들과 쉽게 친해지고, 풍부한 지식을 기꺼이 나누려 합니다. 활기찬 매력과 타고난 재치를 지닌 쌍둥이자리 태생들은 유쾌한 친구이자 동반자가 될 수 있습니다. 재미있고 아이디어가 풍부한 이들은 기운이 넘칠 때 정말 뛰어난 표현력을 발휘합니다.`
        },
        {
            id: 5,
            title: '게자리',
            img: 게자리,
            keyword: '가정적 / 감상적 / 애정',
            desc: `게자리 태생들은 공감 능력이 뛰어나고 인정이 많으며, 사람들을 보살피려는 마음이 강한 성격입니다. 그들은 좋은 부모가 되거나, 간병인이나 치료사로 일하는 데 적합한 성향을 지니고 있습니다. 사랑하는 사람을 지키려는 강한 의지 덕분에 어떤 역경에도 대항해 나갑니다. 따라서 이들의 안정에 대한 욕구는 집과 가족과 깊은 연관이 있으며, 그들에게 큰 가치를 둡니다. 대체로 가정적이고 음식 감식가이며, 요리 솜씨도 뛰어난 편입니다.\n\n기분 변화가 심하지만, 선천적으로 애정이 풍부한 이들은 주변 사람들을 사랑하고 보호하려는 성향이 강합니다. 하지만 이들이 사랑한다고 해서 그들을 숨 막히게 하지는 않도록 주의하는 것이 중요합니다.\n\n게자리는 물의 별자리이기 때문에 부끄러움을 타고 감상적인 면도 있습니다. 과거에 대한 애착이 강한 이들은 열렬한 수집가가 되기 쉽고, 수집 대상은 가보나 골동품뿐만 아니라 사진, 편지와 같은 기억들까지 다양합니다. 또한, 돈을 관리하는 능력이 뛰어나 만약에 대비해 저축하는 데 신경을 씁니다.\n\n게자리 태생들은 성격이 복잡한 면이 있습니다. 한편으로는 든든한 언덕처럼 보이지만, 다른 한편으로는 아이 같은 면모도 보이죠. 그들은 소극적 저항의 대가로, 직접적인 충돌을 피하고 내적으로 저항하는 성향이 있습니다.\n\n달의 영향을 받는 게자리 태생들은 천성적으로 직관력이 강하고 영적 능력이 있으며, 쉽게 상처를 받기도 합니다. 풍부한 상상력과 섬세한 이해력 덕분에 창의적이고 예술적인 분야에서도 두각을 나타낼 수 있습니다.\n\n게자리 태생들은 일단 누군가를 신뢰하고 자신의 감정을 보여줄 정도로 마음을 열면, 그 사람을 더욱 강하고 충실하게 보호하려는 성향을 보입니다.`
        },
        {
            id: 6,
            title: '사자자리',
            img: 사자자리,
            keyword: '자부심 / 자기중심적 / 당당함',
            desc: `사자자리 태생들은 따뜻하고 다정한 성격을 지니며, 마음이 넓고 인정 많고 너그러운 모습이 특징입니다. 이들의 너그러운 태도는 극적인 것을 좋아하는 성향에서 나옵니다. 사자자리 태생들은 대중의 인기를 바라는 동시에, 안목 높은 청중들 사이에서 가장 큰 행복을 느낍니다. 그래서 이들은 무대 중앙을 차지하고 싶어 하며, 다른 사람들의 프로젝트에 대해서도 너그럽게 동의를 표하고 찬사를 아끼지 않습니다.\n\n사자자리 태생들은 사랑스럽고 아이 같은 장난기가 있으며, 창의적이고 자기표현 욕구가 강한 사람들이 많습니다. 코러스 라인에서 활동하기보다는 주연을 맡고 싶어 하며, 때로는 허영심과 오만함이 발목을 잡기도 합니다. 자신이 틀렸다는 것을 인정하는 데 어려움을 겪고, 아첨에도 쉽게 넘어가곤 하죠. 하지만 그들의 쾌활한 성격과 장난기, 관대함 덕분에 어떤 결점도 쉽게 상쇄됩니다.\n\n친화적이고 남과 어울리기 좋아하는 사자자리 태생들은 사교 행사, 파티, 극장 방문, 긴 휴가를 함께할 이상적인 파트너입니다. 그들은 주목받고 싶어 하는 욕망과 당당한 위엄을 지니고 있어, 권한 있는 자리에 올라가며 뛰어난 리더십을 발휘합니다. 자연스럽게 책임을 떠맡는 경향이 있으며, 때로는 요청이 없는데도 자발적으로 일을 맡기 때문에 너무 우두머리처럼 보이기도 합니다. 그럼에도 불구하고 그들은 책임을 다하기 위해 열심히 일해 뛰어난 관리자와 리더로 인정받습니다.\n\n사자자리에서 태어난 사람들은 남들도 자신과 비슷한 고결함을 지니고 있다고 생각하며, 어떤 의견 충돌에서도 자아 존중감을 지키는 데 신경을 씁니다. 그들은 사람들이 자신을 좋게 생각해주기를 바라며, 자신이 남들에게 어떤 인상을 주는지 항상 의식합니다.\n\n활기가 넘치고 열정적이지만 다소 완고한 성격을 지닌 사자자리 태생들은 창의성과 극적인 감각이 결합되면 정말 로맨틱한 성향을 보이며, 사랑하는 것과 사랑받는 것을 좋아합니다.`
        },
        {
            id: 7,
            title: '처녀자리',
            img: 처녀자리,
            keyword: '분별력 / 효율적 / 완벽주의적',
            desc: `처녀자리 태생들은 분석적이고 효율적인 성격을 지닌 직업적인 사람들이 많습니다. 그들은 삶에서 질서를 원하고, 체계적으로 일을 완수하려는 강한 의지를 가집니다. 처녀자리에서 태어난 사람들은 기존의 체계를 개선하려는 끊임없는 노력으로 항상 검토하고 다듬어 나갑니다. 하지만 이러한 완벽주의적인 성향이 때로는 주위 사람들에 대한 비판으로 확장되어, 다른 사람들이 이들의 말을 거부할 수 있는 위험이 존재합니다.\n\n반면, 처녀자리 태생들은 자신의 결함을 지적당하는 것을 달가워하지 않습니다. 자신의 결함을 이미 잘 알고 있으며, 스스로를 가장 가혹하게 평가하기 때문이죠. 이들은 자신의 결점을 인정하기 때문에 겸손하며, 자랑하지 않고 타인에게 봉사함으로써 자아 존중감을 확인합니다.\n\n수성의 영향을 받는 처녀자리 태생들은 지적이고 논리적이며 분별력이 뛰어납니다. 여기에 흙의 원소가 더해져 현실적이고 능력 있는 조직자로, 매우 열심히 일하며 세부적인 부분까지 신경을 씁니다. 경제적이고 돈에 대해 신중한 성향이 강하지만, 누군가가 도움이 필요하면 시간과 돈을 아끼지 않습니다. 하지만 그들이 도움을 줄 때는, 받는 사람이 스스로 일어설 수 있기를 바라는 마음도 큽니다.\n\n처녀자리 태생들은 어리석거나 천박한 일에는 반응하지 않으며, 본능적으로 혼란 속에서 질서를 세우려 합니다. 가장 작은 세부 사항까지 철저히 분석하는 성향이 있지만, 때로는 한 가지 일에 너무 몰두한 나머지 큰 그림을 놓칠 수 있습니다.\n\n그들은 기준이 매우 높고 안목이 뛰어나 특정 분야에서 매우 꼼꼼합니다. 청결함과 영양에 관심이 많고, 운동과 건강한 생활 태도를 중요하게 여깁니다. 하지만 때로는 정신적 긴장으로 지나친 불안에 빠지거나 신경증을 겪을 수도 있습니다. 이러한 긴장은 보통 일의 압박에서 비롯되며, 강한 의무감 때문에 자신이 감당할 수 있는 이상으로 일을 맡게 되는 경향이 있습니다.\n\n처녀자리 태생들은 대개 뛰어난 고용인으로, 어수선한 환경을 싫어하고 철저함과 효율성을 중요시합니다.`
        },
        {
            id: 8,
            title: '천칭자리',
            img: 천칭자리,
            keyword: '사교적 / 분별력 / 예술적',
            desc: `천칭자리 태생들은 황도의 외교관이라 불리며, 불화를 피하고 평화를 지키기 위해 매력을 발산하고 기분 좋은 미소로 상황을 원만하게 만듭니다. 애정이 많고 남과 어울리기를 좋아하는 천칭자리 태생들은 세련되고 쾌활하며, 지적이고 사교적인 성격을 지니고 있습니다. 공기의 속성을 가진 이 별자리에서 태어난 사람들은 사람들과의 교류에서 큰 즐거움을 찾으며, 인기를 얻고 싶어 합니다.\n\n천칭자리 태생들은 금성의 지배를 받으며, 인간관계에 대해 매우 잘 알고 있습니다. 그들은 항상 다른 사람의 시각에서 상황을 바라보며, 균형을 중요시하기 때문에 자신을 더 잘 이해할 수 있는 파트너를 원합니다. 이들은 굉장히 공명정대하고, 모든 상황이나 문제를 신중히 저울질한 뒤에 결정을 내리며, 그 논리적이고 분별력 있는 태도는 놀라운 수준입니다.\n\n금성의 영향을 받는 천칭자리 태생들은 사교적이고 우아하며 미와 화려함을 좋아합니다. 그들은 대체로 멋진 집에서 살기를 원하며, 예술적 감각도 뛰어납니다. 색채에 대한 뛰어난 안목을 지니고 있어 고상하고 조화로운 환경을 중요하게 여기며, 그런 환경이 아니라면 불만을 느낄 수 있습니다. 미에 대한 사랑은 외모에서도 드러나며, 천칭자리 태생들은 자신의 매력을 발산하기 위해 꾸준히 노력합니다.\n\n훌륭한 주인 노릇을 할 수 있는 천칭자리 태생들은 결혼식, 친구들 모임, 소규모 가족 모임과 같은 사교와 애정이 결합된 모임을 좋아합니다. 실제로 이들은 꽃이나 초콜릿 선물에 대한 감동을 크게 느끼며, 이러한 선물로 미에 대한 욕구와 단것에 대한 취향을 채우기도 합니다. 천칭자리 태생들은 로맨틱한 성향이 강하며, 사람들과의 관계에서 아름다움과 조화를 추구하는 존재들입니다.`
        },
        {
            id: 9,
            title: '전갈자리',
            img: 전갈자리,
            keyword: '열정적 / 도전적 / 지구력',
            desc: `전갈자리는 황도에서 가장 열정적인 별자리로, 사람을 끄는 강력한 매력을 지닌 존재들입니다. 이들은 어떤 일이든 전력투구하며, 힘차고 치열하게 임합니다. 전갈자리 태생들에게는 절대 무성의란 있을 수 없으며, 그들은 의지력과 열정으로 가득한 강력한 생명체들입니다.\n\n전갈자리 태생들이 인생에서 가장 중요한 것은 욕구를 극복하는 의지력입니다. 이들은 성욕의 근원과 밀접하게 연결되어 있으며, 감정이 매우 강하고 치열합니다. 때로는 그 강렬한 감정 때문에 질투나 소유욕에 사로잡힐 수 있습니다. 하지만 그만큼 진정성과 진지함을 지닌 사람들입니다.\n\n전갈자리 태생들은 죽음이나 변신을 상징하는 강력한 경험에도 두려움 없이 도전합니다. 이들에게는 거짓된 삶이 있을 수 없으며, 모든 것을 잃는 것조차 두려워하지 않습니다. 그들이 두려움을 극복하고 나면, 엄청난 힘을 얻게 됩니다.\n\n결단력이 강한 전갈자리는 한 번 결정을 내리면, 그 일은 반드시 해내겠다는 의지가 대단합니다. 고정된 성격을 지닌 이 별자리의 태생들은 지구력이 뛰어나 끝까지 버티며, 도전이 있을 때 이를 이겨내려는 경쟁심이 강합니다. 전갈자리 태생들은 질 것을 절대 용납하지 않으며, 패배하면 상대가 틀렸음을 입증하거나 정확히 설욕할 때까지 기다립니다.\n\n그러나 자기편에게는 충실하고 다정한 성격을 지닌 전갈자리 태생들은 헌신적으로 노력과 희생을 마다하지 않으며, 그들을 위해서는 언제든지 헌신합니다.\n\n재생의 별자리인 전갈자리에서 태어난 사람들은 자연의 창조력과 깊은 연결을 지니고 있으며, 그들에게 주어진 잠재력은 엄청납니다. 불사조처럼 잿더미 속에서 다시 태어날 수 있는 신비로운 능력을 지니고 있어, 한 번 쓰러져도 다시 일어설 수 있는 힘을 가집니다. 전갈자리 태생에게는 모 아니면 도의 정신이 강하게 작용하며, 허울뿐인 삶은 결코 용납하지 않습니다.\n\n이들은 자신이 진정으로 살아있다고 느끼는 도전을 필요로 하며, 자기 능력을 발휘할 수 있는 기회가 있을 때 비로소 진정한 힘을 발휘합니다.`
        },
        {
            id: 10,
            title: '사수자리',
            img: 사수자리,
            keyword: '자유 / 낙천적 / 이상주의적',
            desc: `사수자리 태생들은 자유로운 정신의 소유자로, 상냥하고 독립적인 성격을 지닌 사람들입니다. 속박을 싫어하고, 자유롭고 넓은 세상에서 살아가는 걸 선호하죠. 이들은 못 말리는 이상주의자로, 항상 더 높은 목표를 향해 나아가며 시야를 넓히고 운명을 헤쳐 나갑니다. 낙천적이고 느긋한 성격을 지닌 사수자리들은 진실, 정직, 정의를 사랑하며, 인생을 철학적으로 접근하는 경향이 있습니다.\n\n사수자리 태생들은 활기차고 항상 큰 그림을 그리며 원대한 비전을 가지고 있습니다. 미래를 대비하는 계획과 프로젝트에 큰 노력을 기울이며, 탐험과 여행을 좋아하는 마음의 여행자입니다. 지식과 지혜를 중시하고, 자신과 타인에게 영감을 주는 일을 중요하게 여깁니다. 그들은 재치 있는 말과 환한 미소로 사람들을 행복하게 해주고자 하며, 진심으로 다른 사람들을 돕고 싶어 합니다.\n\n그러나 솔직하고 거리낌 없는 성격이 때때로 문제를 일으키기도 합니다. 사수자리 태생들은 생각 없이 말하는 경우가 많아, 종종 역효과를 부를 수 있습니다. 그들은 머릿속에 떠오르는 생각을 그대로 말하는 경향이 있지만, 그런 말이 무례로 받아들여지기도 합니다. 하지만 이들은 쾌활하게 사과하고, 의도하지 않았음을 설명함으로써 상대방의 이해를 얻고, 용서를 받기도 합니다. 사수자리 태생들의 솔직함은 그들의 매력 중 하나로, 대부분의 경우 상대는 이를 용서하게 되죠.\n\n사수자리 태생들은 끊임없이 성장을 추구하며, 더 높은 수준의 교육을 받고 철학, 종교, 여행, 법 같은 깊이 있는 주제들을 탐구하는 것을 즐깁니다. 일부는 지적인 활동보다 게임 같은 즐거운 활동에 빠져들기도 합니다. 또한 운이 따르는 경향이 있어, 모험을 즐기고 도박이나 투기와 같은 위험을 감수하는 경향도 있을 수 있습니다. 이들은 새로운 경험을 통해 자신의 한계를 넘는 것에 끌리며, 그 과정에서 배운 것들을 삶에 적용하려고 합니다.\n\n결국, 사수자리 태생들은 자유와 탐험, 그리고 지혜를 추구하는 성격을 지닌, 늘 긍정적이고 미래지향적인 인물들이라 할 수 있습니다.`
        },
        {
            id: 11,
            title: '염소자리',
            img: 염소자리,
            keyword: '경제적 / 보수적 / 현실주의적',
            desc: `염소자리 태생들은 철저한 현실주의자로, 노력 없이는 얻을 수 없다는 철학을 가지고 살아갑니다. 이들은 목표를 향해 끈기 있게 나아가며, 의무감과 야망이 강한 사람들이죠. 끈기와 인내심으로 무장한 염소자리들은, 산꼭대기에 오르는 데 평생이 걸리더라도 결국 목표를 달성할 것입니다.\n\n염소자리 태생들은 근면하고 부지런하며, 단호한 성격을 지니고 있습니다. 하지만 이들에게는 정확한 목표가 필요합니다. 목표가 없으면 길을 잃고 방황할 수 있기 때문이죠. 완벽주의 성향이 강해 질서와 체계를 중시하며, 하루 일과를 계획하고 목표 목록을 작성하는 습관이 있습니다. 안전과 보수적 태도를 중시하는 염소자리는 토성의 지배를 받으며, 신중하게 행동하고 결정을 내립니다.\n\n권위와 연륜, 경험을 매우 존중하며, 일이든 인간 관계든 성실하게 임하는 염소자리 태생들은 책임감이 강합니다. 하지만 그만큼 완고하고 냉정하며 때로는 계산적이 될 수 있습니다. 토성의 영향으로 준엄함이 자주 나타나며, 이들이 가진 자제력이 때로는 이기적인 모습으로 비춰지기도 합니다. 이들은 또한 경제적이고 현실적인 성향을 지니며, 알뜰하고 계획적인 방식으로 살아갑니다.\n\n지위와 명성을 향한 욕구가 강한 염소자리 태생들은 결과를 중요시하고, 책임을 진지하게 받아들여 지배적인 위치에 오를 수 있는 잠재력을 가지고 있습니다. 다만, 비관적이거나 자신이 부족하다고 느끼는 순간에는 우울증이나 의욕 상실에 빠질 수 있으므로 긍정적인 마인드를 유지하는 것이 중요합니다.\n\n이들은 자기 자신과 능력에 대한 의심으로 시도조차 하지 않는 경우도 있을 수 있지만, 탄탄한 토대를 다지면 안정적인 마음 상태에서 성공을 향해 나아갈 수 있습니다. 또한, 수줍고 내성적인 외모 뒤에는 천연덕스러운 유머와 끈기가 숨어 있어, 겉모습과는 다른 매력을 발산합니다.\n\n결국, 염소자리 태생들은 차근차근 목표를 향해 나아가고, 끊임없이 자신을 성장시키는 사람들입니다. 현실적이고 신중한 성향 덕분에, 장기적인 성공을 거둘 수 있는 타입입니다.`
        }
    ]

    return (
        <Container>
            <Tabs
                orientation="vertical"
                variant="scrollable"
                value={value}
                onChange={handleChange}
                indicatorColor="secondary"
                textColor='inherit'
                sx={{ borderRight: 1, borderColor: 'divider' }}
            >
                {itemList.map(item => <Tab label={item.title} style={{ color: 'white' }} />)}
            </Tabs>
            {
                itemList.map(item => {
                    return <TabPanel value={value} index={item.id}>
                        <div style={{ display: 'flex' }}>
                            <img src={item.img} style={{ width: '40%', height: '50%' }} />
                            <div style={{ flex: 0.9 }}>
                                <Keyword>{item.keyword}</Keyword>
                                <Description>{item.desc}</Description>
                            </div>
                        </div>
                    </TabPanel>
                })
            }
        </Container>
    )
}

export default Personality;